/** 地图基础操作 */
interface MapUser {
  /** 复位的经纬度 */
  ezjcfw: fw
  /** 项目群复位 */
  xmqfw: fw
  /** 武黄复位 */
  whfw: fw
  /** 地图的dataSetId */
  tdw: string
  /** 航飞影像 */
  hfyx: string
  /** 模型id */
  bimid: string
  /** 全线id */
  qxid: string
}

interface fw {
  camPos: number[]
  camRotate: number[]
  camDir: number[]
}

const mapuser: MapUser = {
  ezjcfw: {
    camPos: [12774724.534101209, 3529512.7287518647, 22975.13453348849],
    camRotate: [0.017820784277242478, -0.04935629432978021, -0.9392721565256413, 0.3391374232275826],
    camDir: [0.0669542659162552, -0.08063059630713662, -0.9944927517155522]
  },
  xmqfw: {
    camPos: [12784567.205952493, 3537949.506216555, 93493.8029811923],
    camRotate: [-0.019966109266402802, -0.06379789318252493, -0.9522204425756948, -0.2980057248563881],
    camDir: [-0.07604854960867506, -0.10959928643432919, -0.9910623666124666]
  },
  whfw: {
    camPos: [12780099.961889524, 3537867.548453203, 27679.633115359167],
    camRotate: [0.23339176791999133, -0.03262800281550623, -0.13455338847668974, 0.9624754967005099],
    camDir: [0.1256146128648, 0.4404872988331009, -0.8889273921989045]
  },
  tdw: '3a0ee4e20ea988ae6935e332e0f1185e',
  hfyx: '3a0ff909-5091-1db0-2646-ac0a4c1c89e0',
  bimid: '3a12d42d-7e83-e79b-141a-996e0f704210',
  qxid: '3a111adfe1006cd08d352d70711bb02e'
}

export default mapuser
